In [1]:
import mysql.connector as connection

In [3]:
def executeQuery(query):
    con = connection.connect(host='localhost',user='root',passwd='admin',database='sakila',use_pure=True)
    cursor = con.cursor()
    cursor.execute(query)
    result = cursor.fetchall()
    return result

Q-17. Write an SQL query to show the top n (say 10) records of a table.

In [4]:
query = "select * from customer order by customer_id asc limit 10"
executeQuery(query)

[(1,
  1,
  'MARY',
  'SMITH',
  'MARY.SMITH@sakilacustomer.org',
  5,
  1,
  datetime.datetime(2006, 2, 14, 22, 4, 36),
  datetime.datetime(2006, 2, 15, 4, 57, 20)),
 (2,
  1,
  'PATRICIA',
  'JOHNSON',
  'PATRICIA.JOHNSON@sakilacustomer.org',
  6,
  1,
  datetime.datetime(2006, 2, 14, 22, 4, 36),
  datetime.datetime(2006, 2, 15, 4, 57, 20)),
 (3,
  1,
  'LINDA',
  'WILLIAMS',
  'LINDA.WILLIAMS@sakilacustomer.org',
  7,
  1,
  datetime.datetime(2006, 2, 14, 22, 4, 36),
  datetime.datetime(2006, 2, 15, 4, 57, 20)),
 (4,
  2,
  'BARBARA',
  'JONES',
  'BARBARA.JONES@sakilacustomer.org',
  8,
  1,
  datetime.datetime(2006, 2, 14, 22, 4, 36),
  datetime.datetime(2006, 2, 15, 4, 57, 20)),
 (5,
  1,
  'ELIZABETH',
  'BROWN',
  'ELIZABETH.BROWN@sakilacustomer.org',
  9,
  1,
  datetime.datetime(2006, 2, 14, 22, 4, 36),
  datetime.datetime(2006, 2, 15, 4, 57, 20)),
 (6,
  2,
  'JENNIFER',
  'DAVIS',
  'JENNIFER.DAVIS@sakilacustomer.org',
  10,
  1,
  datetime.datetime(2006, 2, 14, 22, 4, 36),
  datetime.datetime(2006, 2, 15, 4, 57, 20)),
 (7,
  1,
  'MARIA',
  'MILLER',
  'MARIA.MILLER@sakilacustomer.org',
  11,
  1,
  datetime.datetime(2006, 2, 14, 22, 4, 36),
  datetime.datetime(2006, 2, 15, 4, 57, 20)),
 (8,
  2,
  'SUSAN',
  'WILSON',
  'SUSAN.WILSON@sakilacustomer.org',
  12,
  1,
  datetime.datetime(2006, 2, 14, 22, 4, 36),
  datetime.datetime(2006, 2, 15, 4, 57, 20)),
 (9,
  2,
  'MARGARET',
  'MOORE',
  'MARGARET.MOORE@sakilacustomer.org',
  13,
  1,
  datetime.datetime(2006, 2, 14, 22, 4, 36),
  datetime.datetime(2006, 2, 15, 4, 57, 20)),
 (10,
  1,
  'DOROTHY',
  'TAYLOR',
  'DOROTHY.TAYLOR@sakilacustomer.org',
  14,
  1,
  datetime.datetime(2006, 2, 14, 22, 4, 36),
  datetime.datetime(2006, 2, 15, 4, 57, 20))]

Q-18. Write an SQL query to determine the nth (say n=5) highest salary from a table.

In [8]:
query = "select Salary from (select distinct salary,dense_rank() over(order by salary desc) as dummy FROM sakila.worker) as t where t.dummy=5;"
executeQuery(query)

[(90000,)]